; domain
; ==========================================================
; DOMAIN: SATELLITE (ENHSP FIXED)
; ==========================================================

(define (domain satellite)

(:requirements
    :typing
    :negative-preconditions
    :fluents
)

; ==========================================================
;
(:types
    direction
    target ;
)

(:constants
    N NE E SE S SW W NW - direction
)

; ==========================================================
;
(:predicates
    (pointing ?d - direction)
    (visible ?t - target ?d - direction)
    (stored ?t - target)
    (sent ?t - target)

    (hd ?t - target)
    (sd ?t - target)

    (next-right ?from - direction ?to - direction)
    (next-left ?from - direction ?to - direction)

    ;
    (is-north ?d - direction)
)

; ==========================================================
;
(:functions
    (charge)
    (memory-used)
    (max-memory)
    (photo-count)
)

; ==========================================================
;
(:action rotate-right
    :parameters (?from - direction ?to - direction)
    :precondition
    (and
        (pointing ?from)
        (next-right ?from ?to)
        (>= (charge) 1)
    )
    :effect
    (and
        (not (pointing ?from))
        (pointing ?to)
        (decrease (charge) 1)
    )
)

(:action rotate-left
    :parameters (?from - direction ?to - direction)
    :precondition
    (and
        (pointing ?from)
        (next-left ?from ?to)
        (>= (charge) 1)
    )
    :effect
    (and
        (not (pointing ?from))
        (pointing ?to)
        (decrease (charge) 1)
    )
)

; ==========================================================
(:action take-picture-hd
    :parameters (?t - target ?d - direction)
    :precondition
    (and
        (pointing ?d)
        (visible ?t ?d)
        (hd ?t)
        (not (stored ?t))
        (not (sent ?t))

        (>= (charge) 2)
        (<= (photo-count) 1) ;
        (<= (+ (memory-used) 10) (max-memory))
    )
    :effect
    (and
        (stored ?t)
        (decrease (charge) 2)
        (increase (photo-count) 1)
        (increase (memory-used) 10)
    )
)

(:action take-picture-sd
    :parameters (?t - target ?d - direction)
    :precondition
    (and
        (pointing ?d)
        (visible ?t ?d)
        (sd ?t)
        (not (stored ?t))
        (not (sent ?t))

        (>= (charge) 2)
        (<= (photo-count) 1) ;
        (<= (+ (memory-used) 3) (max-memory))
    )
    :effect
    (and
        (stored ?t)
        (decrease (charge) 2)
        (increase (photo-count) 1)
        (increase (memory-used) 3)
    )
)

; ==========================================================
(:action send-hd
    :parameters (?t - target ?d - direction)
    :precondition
    (and
        (pointing ?d)
        (is-north ?d)
        (stored ?t)
        (hd ?t)
        (>= (charge) 2)
    )
    :effect
    (and
        (not (stored ?t))
        (sent ?t)

        (decrease (charge) 2)
        (decrease (photo-count) 1)
        (decrease (memory-used) 10)
    )
)

(:action send-sd
    :parameters (?t - target ?d - direction)
    :precondition
    (and
        (pointing ?d)
        (is-north ?d)
        (stored ?t)
        (sd ?t)
        (>= (charge) 2)
    )
    :effect
    (and
        (not (stored ?t))
        (sent ?t)

        (decrease (charge) 2)
        (decrease (photo-count) 1)
        (decrease (memory-used) 3)
    )
)
)

; problem
; ==========================================================
; PROBLEM: HARD
; ==========================================================

(define (problem satellite-hard)

(:domain satellite)

; ==========================================================
; OBJECTS
(:objects
    star1 planet1 galaxy1 - target
)

; ==========================================================
; INITIAL STATE
(:init
    ; Начальное направление (Юго-Запад)
    (pointing SW)
    ; Указываем, где находится Земля для отправки
    (is-north N)

    ; Видимость объектов
    (visible star1 E)
    (visible planet1 S)
    (visible galaxy1 NW)

    ; Требования к качеству (перенесено из Goal)
    (sd star1)
    (sd planet1)
    (sd galaxy1)

    ; Численные переменные
    (= (memory-used) 0)
    (= (max-memory) 16) ; Вместимость из оригинального файла
    (= (charge) 75)     ; Заряд (было energy)
    (= (photo-count) 0)

    ; Топология компаса (по часовой стрелке)
    (next-right N NE)
    (next-right NE E)
    (next-right E SE)
    (next-right SE S)
    (next-right S SW)
    (next-right SW W)
    (next-right W NW)
    (next-right NW N)

    ; Топология компаса (против часовой стрелки)
    (next-left N NW)
    (next-left NW W)
    (next-left W SW)
    (next-left SW S)
    (next-left S SE)
    (next-left SE E)
    (next-left E NE)
    (next-left NE N)
)

; ==========================================================
; GOAL STATE
(:goal
    (and
        (sent star1)
        (sent planet1)
        (sent galaxy1)
    )
)

; ==========================================================
; METRIC
; Ищем план, который сохранит максимум батареи
(:metric maximize (charge))

)

; plan
1. (rotate-right sw w)
   deleted: (pointing sw)
   added: (pointing w)
   changed: (charge) from 75 to 74
   goals met: 0 of 3
2. (rotate-right w nw)
   deleted: (pointing w)
   added: (pointing nw)
   changed: (charge) from 74 to 73
   goals met: 0 of 3
3. (take-picture-sd galaxy1 nw)
   added: (stored galaxy1)
   changed: (charge) from 73 to 71, (photo-count) from 0 to 1, (memory-used) from 0 to 3
   goals met: 0 of 3
4. (rotate-right nw n)
   deleted: (pointing nw)
   added: (pointing n)
   changed: (charge) from 71 to 70
   goals met: 0 of 3
5. (send-sd galaxy1 n)
   deleted: (stored galaxy1)
   added: (sent galaxy1)
   changed: (charge) from 70 to 68, (photo-count) from 1 to 0, (memory-used) from 3 to 0
   goals met: 1 of 3
6. (rotate-right n ne)
   deleted: (pointing n)
   added: (pointing ne)
   changed: (charge) from 68 to 67
   goals met: 1 of 3
7. (rotate-right ne e)
   deleted: (pointing ne)
   added: (pointing e)
   changed: (charge) from 67 to 66
   goals met: 1 of 3
8. (take-picture-sd star1 e)
   added: (stored star1)
   changed: (charge) from 66 to 64, (photo-count) from 0 to 1, (memory-used) from 0 to 3
   goals met: 1 of 3
9. (rotate-right e se)
   deleted: (pointing e)
   added: (pointing se)
   changed: (charge) from 64 to 63
   goals met: 1 of 3
10. (rotate-right se s)
   deleted: (pointing se)
   added: (pointing s)
   changed: (charge) from 63 to 62
   goals met: 1 of 3
11. (take-picture-sd planet1 s)
   added: (stored planet1)
   changed: (charge) from 62 to 60, (photo-count) from 1 to 2, (memory-used) from 3 to 6
   goals met: 1 of 3
12. (rotate-left s se)
   deleted: (pointing s)
   added: (pointing se)
   changed: (charge) from 60 to 59
   goals met: 1 of 3
13. (rotate-left se e)
   deleted: (pointing se)
   added: (pointing e)
   changed: (charge) from 59 to 58
   goals met: 1 of 3
14. (rotate-left e ne)
   deleted: (pointing e)
   added: (pointing ne)
   changed: (charge) from 58 to 57
   goals met: 1 of 3
15. (rotate-left ne n)
   deleted: (pointing ne)
   added: (pointing n)
   changed: (charge) from 57 to 56
   goals met: 1 of 3
16. (send-sd planet1 n)
   deleted: (stored planet1)
   added: (sent planet1)
   changed: (charge) from 56 to 54, (photo-count) from 2 to 1, (memory-used) from 6 to 3
   goals met: 2 of 3
17. (send-sd star1 n)
   deleted: (stored star1)
   added: (sent star1)
   changed: (charge) from 54 to 52, (photo-count) from 1 to 0, (memory-used) from 3 to 0
   goals met: 3 of 3
